package ru.stimmax.lessons.lesson03.homework

//1.Название мероприятия

//2.Дата проведения

//3.Место проведения

//4.Подробный бюджет мероприятия, включая расходы на оборудование, кейтеринг и другие операционные расходы.

//5.Количество участников

//6.Длительность хакатона

//7.Контактная информация и условия соглашений с поставщиками пищи, оборудования и других услуг.

//8.Текущее состояние хакатона (статус)

//9.Список спонсоров

//10.Бюджет мероприятия

//11.Текущий уровень доступа к интернету

//12.Информация о транспортировке оборудования, распределении ресурсов и координации между различными командами поддержки.

//13.Количество команд

//14.Перечень задач

//15.План эвакуации

//16.Список доступного оборудования (всё, что выделено для использования на мероприятии)

//17.Список свободного оборудования (всё, что можно взять прямо сейчас и что не занято другими участниками)

//18.График питания участников (зависит от поставщика питания, определяемого за неделю до начала)

//19.План мероприятий на случай сбоев

//20.Список экспертов и жюри

//21.Политика конфиденциальности

//22.Приватные отзывы (фидбэк) участников и зрителей для анализа проблем.

//23.Текущая температура в помещении

//24.Данные мониторинга и анализ производительности сетевого оборудования и интернет-соединения для целей отладки своих приложений командами

//25.Регулятор скорости интернета (понижающий коэффициент, например 0.5)

//26.Уровень освещения

//27.Лог событий мероприятия

//28.Возможность получения медицинской помощи прямо на мероприятии (да/нет)

//29.Планы и процедуры для обеспечения безопасности мероприятия, включая планы эвакуации и протоколы чрезвычайных ситуаций.

//30.Регистрационный номер мероприятия

//31.Максимально допустимый уровень шума в помещении хакатона.

//32.Индикатор превышения уровня шума в помещениях (превышен или не превышен в данный момент)

//33.План взаимодействия с прессой

//34.Детальная публичная информация о проектах каждой команды, сбор данных включает в себя компиляцию кода и сбор статистики прогона автоматизированных проверок.

//35.Статус получения всех необходимых разрешений для проведения мероприятия

//36.Индикатор доступности специализированного оборудования в данный момент (например, специальному оборудованию)

//37.Список партнеров мероприятия

//38.Отчет, включающий фотографии, видео и отзывы, генерируется и становится доступен после завершения мероприятия.

//39.Внутренние правила распределения призов

//40.Список разыгрываемых призов

//41.Контактная информация экстренных служб, медицинского персонала и других важных служб, для внутреннего пользования.

//42.Особые условия для участников с ограниченными возможностями

//43.Общее настроение участников (определяется опросами)

//44.Подробный план хакатона, включающий время и содержание каждого сегмента, инициализируется непосредственно перед началом мероприятия, так как зависит от фактического состава команд и взятых в работу задач.

//45.Имя знаменитого специального гостя, которое будет объявлено за день до мероприятия, но в момент инициализации неизвестно.

//46.Максимальное количество людей, которое может вместить место проведения.

//47.Количество часов, отведенное каждой команде для работы над проектом.